#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```tls_private_key.azmi1-tf-tls: Refreshing state... [id=e17fcc0bc2ea58744492162c612bfceb530801a5]
local_sensitive_file.azmi1-tf-private-key: Refreshing state... [id=facaddcd0da6873a54847c17b2a327cc6713357f]
data.aws_security_group.vpc_sg_data: Reading...
data.aws_subnet.public_subnet_data: Reading...
module.ec2_instance.data.aws_partition.current: Reading...
aws_key_pair.azmi1-tf-keypair: Refreshing state... [id=azmi1-tf-keypair]
aws_ecr_repository.ecr_repo: Refreshing state... [id=azmi1-nodejs-app]
data.aws_ami.aws_ami_data: Reading...
module.ec2_instance.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_security_group.vpc_sg_data: Read complete after 1s [id=sg-0d6bfc561f5620e5f]
data.aws_subnet.public_subnet_data: Read complete after 1s [id=subnet-076c22fe216f37497]
data.aws_ami.aws_ami_data: Read complete after 1s [id=ami-0fff1b9a61dec8a5f]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-0d5eb905abb1fb3d1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.azmi1-tf-private-key will be created
  + resource "local_sensitive_file" "azmi1-tf-private-key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "/tmp/azmi1-tf-private-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @RaytraceSG, Action: `pull_request`, Workflow: `Terraform Checks`*